Repository: venxsa/discord.py-master-main
Catalog: docs/locale/*/LC_MESSAGES/discord.po
Languages: pl_pl

source: Creating a Bot Account
pl_pl: Tworzenie konta bota

source: In order to work with the library and the Discord API in general, we must first create a Discord Bot account.
pl_pl: Aby móc pracować z biblioteką i ogólnie z API Discorda, musimy najpierw utworzyć konto bota Discord.

source: Creating a Bot account is a pretty straightforward process.
pl_pl: Tworzenie konta bota jest dość prostym procesem.

source: Make sure you're logged on to the `Discord website <https://discord.com>`_.
pl_pl: Upewnij się, że jesteś zalogowany na `stronie Discord <https://discord.com>`_.

source: Navigate to the `application page <https://discord.com/developers/applications>`_
pl_pl: Przejdź do `strony aplikacji <https://discord.com/developers/applications>`_

source: Click on the "New Application" button.
pl_pl: Kliknij przycisk „New Application” (Nowa aplikacja).

source: The new application button.
pl_pl: Przycisk nowej aplikacji.

source: Give the application a name and click "Create".
pl_pl: Nadaj aplikacji nazwę i kliknij „Create” (Utwórz).

source: The new application form filled in.
pl_pl: Wypełniony formularz nowej aplikacji.

source: Navigate to the "Bot" tab to configure it.
pl_pl: Przejdź do zakładki „Bot”, aby go skonfigurować.

source: Make sure that **Public Bot** is ticked if you want others to invite your bot.
pl_pl: Upewnij się, że opcja **Public Bot** jest zaznaczona, jeśli chcesz, aby inni mogli zapraszać Twojego bota.

source: You should also make sure that **Require OAuth2 Code Grant** is unchecked unless you are developing a service that needs it. If you're unsure, then **leave it unchecked**.
pl_pl: Powinieneś również upewnić się, że opcja **Require OAuth2 Code Grant** jest odznaczona, chyba że tworzysz usługę, która jej wymaga. Jeśli nie masz pewności, **pozostaw ją odznaczoną**.

source: How the Bot User options should look like for most people.
pl_pl: Jak powinny wyglądać opcje użytkownika bota dla większości osób.

source: Copy the token using the "Copy" button.
pl_pl: Skopiuj token za pomocą przycisku „Copy” (Kopiuj).

source: **This is not the Client Secret at the General Information page.**
pl_pl: **To nie jest Client Secret dostępny na stronie General Information (Informacje ogólne).**

source: It should be worth noting that this token is essentially your bot's password. You should **never** share this with someone else. In doing so, someone can log in to your bot and do malicious things, such as leaving servers, ban all members inside a server, or pinging everyone maliciously.
pl_pl: Warto zauważyć, że ten token jest w zasadzie hasłem Twojego bota. **Nigdy** nie powinieneś udostępniać go nikomu innemu. Robiąc to, ktoś może zalogować się jako Twój bot i wykonywać złośliwe działania, takie jak opuszczanie serwerów, banowanie wszystkich członków na serwerze lub złośliwe pingowanie wszystkich.

source: The possibilities are endless, so **do not share this token.**
pl_pl: Możliwości są nieograniczone, więc **nie udostępniaj tego tokena.**

source: If you accidentally leaked your token, click the "Regenerate" button as soon as possible. This revokes your old token and re-generates a new one. Now you need to use the new token to login.
pl_pl: Jeśli przypadkowo ujawniłeś swój token, jak najszybciej kliknij przycisk „Regenerate” (Zregeneruj). Spowoduje to unieważnienie starego tokena i wygenerowanie nowego. Od teraz będziesz musiał używać nowego tokena do logowania.

source: And that's it. You now have a bot account and you can login with that token.
pl_pl: I to wszystko. Masz teraz konto bota i możesz logować się za pomocą tego tokena.

source: Inviting Your Bot
pl_pl: Zapraszanie bota

source: So you've made a Bot User but it's not actually in any server.
pl_pl: Utworzyłeś konto bota, ale nie ma go jeszcze na żadnym serwerze.

source: If you want to invite your bot you must create an invite URL for it.
pl_pl: Jeśli chcesz zaprosić swojego bota, musisz utworzyć dla niego adres URL zaproszenia.

source: Click on your bot's page.
pl_pl: Kliknij stronę swojego bota.

source: Go to the "OAuth2 > URL Generator" tab.
pl_pl: Przejdź do zakładki „OAuth2 > URL Generator”.

source: How the OAuth2 page should look like.
pl_pl: Jak powinna wyglądać strona OAuth2.

source: Tick the "bot" checkbox under "scopes".
pl_pl: Zaznacz opcję „bot” w sekcji „scopes” (zakresy).

source: The scopes checkbox with "bot" ticked.
pl_pl: Zaznaczona opcja „bot” w sekcji zakresów.

source: Tick the permissions required for your bot to function under "Bot Permissions".
pl_pl: Zaznacz uprawnienia wymagane do działania bota w sekcji „Bot Permissions” (Uprawnienia bota).

source: Please be aware of the consequences of requiring your bot to have the "Administrator" permission.
pl_pl: Bądź świadomy konsekwencji wymagania od bota uprawnienia „Administrator”.

source: Bot owners must have 2FA enabled for certain actions and permissions when added in servers that have Server-Wide 2FA enabled. Check the `2FA support page <https://support.discord.com/hc/en-us/articles/219576828-Setting-up-Two-Factor-Authentication>`_ for more information.
pl_pl: Właściciele botów muszą mieć włączone uwierzytelnianie dwuskładnikowe (2FA) dla niektórych akcji i uprawnień, gdy bot jest dodawany do serwerów z włączonym wymogiem 2FA w całym serwerze. Sprawdź `stronę pomocy 2FA <https://support.discord.com/hc/en-us/articles/219576828-Setting-up-Two-Factor-Authentication>`_ aby uzyskać więcej informacji.

source: The permission checkboxes with some permissions checked.
pl_pl: Zaznaczone pola uprawnień.

source: Now the resulting URL can be used to add your bot to a server. Copy and paste the URL into your browser, choose a server to invite the bot to, and click "Authorize".
pl_pl: Teraz wygenerowany adres URL może zostać użyty do dodania bota na serwer. Skopiuj i wklej ten adres do przeglądarki, wybierz serwer, na który chcesz zaprosić bota, i kliknij „Authorize” (Autoryzuj).

source: The person adding the bot needs "Manage Server" permissions to do so.
pl_pl: Osoba dodająca bota musi mieć uprawnienie „Zarządzanie serwerem” (Manage Server).

source: If you want to generate this URL dynamically at run-time inside your bot and using the :class:`discord.Permissions` interface, you can use :func:`discord.utils.oauth_url`.
pl_pl: Jeśli chcesz wygenerować ten adres URL dynamicznie w trakcie działania bota, korzystając z interfejsu :class:`discord.Permissions`, możesz użyć funkcji :func:`discord.utils.oauth_url`.
