Repository: venxsa/discord.py-master-main
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: pl_pl

source: discord.ext.commands API Reference
pl_pl: Dokumentacja API discord.ext.commands

source: discord.ext.tasks API Reference
pl_pl: Dokumentacja API discord.ext.tasks

source: Welcome to discord.py
pl_pl: Witaj w discord.py

source: discord.py is a modern, easy to use, feature-rich, and async ready API wrapper for Discord.
pl_pl: discord.py to nowoczesny, łatwy w użyciu, bogaty w funkcje i gotowy na asynchroniczność wrapper API dla Discorda.

source: **Features:**
pl_pl: **Funkcje:**

source: Modern Pythonic API using ``async``\/``await`` syntax
pl_pl: Nowoczesne, pythonowe API wykorzystujące składnię ``async``\/``await``

source: Sane rate limit handling that prevents 429s
pl_pl: Rozsądna obsługa limitów zapytań zapobiegająca błędom 429

source: Command extension to aid with bot creation
pl_pl: Rozszerzenie poleceń wspomagające tworzenie botów

source: Easy to use with an object oriented design
pl_pl: Łatwy w użyciu dzięki obiektowemu projektowi

source: Optimised for both speed and memory
pl_pl: Zoptymalizowany pod kątem szybkości i pamięci

source: Getting started
pl_pl: Pierwsze kroki

source: Is this your first time using the library? This is the place to get started!
pl_pl: Czy używasz tej biblioteki po raz pierwszy? To jest miejsce, od którego powinieneś zacząć!

source: **First steps:** :doc:`intro` | :doc:`quickstart` | :doc:`logging`
pl_pl: **Pierwsze kroki:** :doc:`intro` | :doc:`quickstart` | :doc:`logging`

source: **Working with Discord:** :doc:`discord` | :doc:`intents`
pl_pl: **Praca z Discordem:** :doc:`discord` | :doc:`intents`

source: **Examples:** Many examples are available in the :resource:`repository <examples>`.
pl_pl: **Przykłady:** Wiele przykładów jest dostępnych w :resource:`repozytorium <examples>`.

source: Getting help
pl_pl: Uzyskiwanie pomocy

source: If you're having trouble with something, these resources might help.
pl_pl: Jeśli masz z czymś problem, te zasoby mogą pomóc.

source: Try the :doc:`faq` first, it's got answers to all common questions.
pl_pl: Najpierw sprawdź :doc:`faq`, zawiera odpowiedzi na najczęściej zadawane pytania.

source: Ask us and hang out with us in our :resource:`Discord <discord>` server.
pl_pl: Zapytaj nas i spędź z nami czas na naszym serwerze :resource:`Discord <discord>`.

source: If you're looking for something specific, try the :ref:`index <genindex>` or :ref:`searching <search>`.
pl_pl: Jeśli szukasz czegoś konkretnego, spróbuj skorzystać z :ref:`indeksu <genindex>` lub :ref:`wyszukiwania <search>`.

source: Report bugs in the :resource:`issue tracker <issues>`.
pl_pl: Zgłaszaj błędy w :resource:`systemie śledzenia błędów <issues>`.

source: Ask in our :resource:`GitHub discussions page <discussions>`.
pl_pl: Zapytaj na naszej :resource:`stronie dyskusji GitHub <discussions>`.

source: Extensions
pl_pl: Rozszerzenia

source: These extensions help you during development when it comes to common tasks.
pl_pl: Te rozszerzenia pomogą Ci podczas tworzenia bota w typowych zadaniach.

source: Manuals
pl_pl: Podręczniki

source: These pages go into great detail about everything the API can do.
pl_pl: Te strony szczegółowo opisują wszystko, co potrafi to API.

source: If you're looking for something related to the project itself, it's here.
pl_pl: Jeśli szukasz czegoś związanego z samym projektem, znajdziesz to tutaj.
