Repository: venxsa/discord.py-master-main
Catalog: docs/locale/*/LC_MESSAGES/intents.po
Languages: pl_pl

source: A Primer to Gateway Intents
pl_pl: Wprowadzenie do Gateway Intents

source: In version 1.5 comes the introduction of :class:`Intents`. This is a radical change in how bots are written. An intent basically allows a bot to subscribe to specific buckets of events. The events that correspond to each intent is documented in the individual attribute of the :class:`Intents` documentation.
pl_pl: W wersji 1.5 wprowadzono :class:`Intents` (intencje). Jest to radykalna zmiana w sposobie pisania botów. Intencja zasadniczo pozwala botowi subskrybować określone grupy zdarzeń. Zdarzenia odpowiadające każdej intencji są udokumentowane w poszczególnych atrybutach dokumentacji klasy :class:`Intents`.

source: These intents are passed to the constructor of :class:`Client` or its subclasses (:class:`AutoShardedClient`, :class:`~.AutoShardedBot`, :class:`~.Bot`) with the ``intents`` argument.
pl_pl: Intencje te są przekazywane do konstruktora klasy :class:`Client` lub jej podklas (:class:`AutoShardedClient`, :class:`~.AutoShardedBot`, :class:`~.Bot`) za pomocą argumentu ``intents``.

source: What intents are needed?
pl_pl: Które intencje są potrzebne?

source: The intents that are necessary for your bot can only be dictated by yourself. Each attribute in the :class:`Intents` class documents what :ref:`events <discord-api-events>` it corresponds to and what kind of cache it enables.
pl_pl: O tym, jakie intencje są niezbędne dla Twojego bota, decydujesz Ty sam. Każdy atrybut w klasie :class:`Intents` opisuje, jakim :ref:`zdarzeniom <discord-api-events>` odpowiada oraz jaki rodzaj pamięci podręcznej (cache) aktywuje.

source: For example, if you want a bot that functions without spammy events like presences or typing then we could do the following:
pl_pl: Na przykład, jeśli chcesz, aby bot działał bez „spamujących” zdarzeń, takich jak statusy obecności (presences) czy informacja o pisaniu (typing), możesz zrobić to tak:

source: Note that this doesn't enable :attr:`Intents.members` since it's a privileged intent.
pl_pl: Zauważ, że nie włącza to :attr:`Intents.members`, ponieważ jest to intencja uprzywilejowana.

source: Another example showing a bot that only deals with messages and guild information:
pl_pl: Inny przykład pokazujący bota, który obsługuje tylko wiadomości i informacje o serwerach (gildiach):

source: Privileged Intents
pl_pl: Uprzywilejowane intencje

source: With the API change requiring bot authors to specify intents, some intents were restricted further and require more manual steps. These intents are called **privileged intents**.
pl_pl: Wraz ze zmianą API wymagającą od autorów botów określenia intencji, niektóre z nich zostały dodatkowo ograniczone i wymagają wykonania ręcznych kroków. Są to tak zwane **uprzywilejowane intencje** (privileged intents).

source: A privileged intent is one that requires you to go to the developer portal and manually enable it. To enable privileged intents do the following:
pl_pl: Uprzywilejowana intencja wymaga przejścia do portalu deweloperskiego i jej ręcznego aktywowania. Aby włączyć uprzywilejowane intencje, wykonaj następujące kroki:

source: Make sure you're logged on to the `Discord website <https://discord.com>`_.
pl_pl: Upewnij się, że jesteś zalogowany na `stronie Discord <https://discord.com>`_.

source: Navigate to the `application page <https://discord.com/developers/applications>`_.
pl_pl: Przejdź do `strony aplikacji <https://discord.com/developers/applications>`_.

source: Click on the bot you want to enable privileged intents for.
pl_pl: Kliknij bota, dla którego chcesz włączyć uprzywilejowane intencje.

source: Navigate to the bot tab on the left side of the screen.
pl_pl: Przejdź do zakładki „Bot” po lewej stronie ekranu.

source: The bot tab in the application page.
pl_pl: Zakładka bota na stronie aplikacji.

source: Scroll down to the "Privileged Gateway Intents" section and enable the ones you want.
pl_pl: Przewiń w dół do sekcji „Privileged Gateway Intents” i włącz te intencje, których potrzebujesz.

source: The privileged gateway intents selector.
pl_pl: Selektor uprzywilejowanych intencji gatewaya.

source: Enabling privileged intents when your bot is in over 100 guilds requires going through `bot verification <https://support.discord.com/hc/en-us/articles/360040720412>`_. If your bot is already verified and you would like to enable a privileged intent you must go through `Discord support <https://dis.gd/contact>`_ and talk to them about it.
pl_pl: Włączenie uprzywilejowanych intencji, gdy bot znajduje się na ponad 100 serwerach, wymaga przejścia procesu `weryfikacji bota <https://support.discord.com/hc/en-us/articles/360040720412>`_. Jeśli Twój bot jest już zweryfikowany i chcesz włączyć uprzywilejowaną intencję, musisz skontaktować się z `pomocą techniczną Discorda <https://dis.gd/contact>`_.

source: Even if you enable intents through the developer portal, you still have to enable the intents through code as well.
pl_pl: Nawet jeśli włączysz intencje w portalu deweloperskim, musisz je również aktywować w kodzie bota.

source: Do I need privileged intents?
pl_pl: Czy potrzebuję uprzywilejowanych intencji?

source: This is a quick checklist to see if you need specific privileged intents.
pl_pl: Oto krótka lista sprawdzająca, czy potrzebujesz konkretnych uprzywilejowanych intencji.

source: Presence Intent
pl_pl: Intencja obecności (Presence Intent)

source: Whether you use :attr:`Member.status` at all to track member statuses.
pl_pl: Czy używasz :attr:`Member.status` do śledzenia statusów członków.

source: Whether you use :attr:`Member.activity` or :attr:`Member.activities` to check member's activities.
pl_pl: Czy używasz :attr:`Member.activity` lub :attr:`Member.activities` do sprawdzania aktywności członków.

source: Member Intent
pl_pl: Intencja członków (Member Intent)

source: Whether you track member joins or member leaves, corresponds to :func:`on_member_join` and :func:`on_member_remove` events.
pl_pl: Czy śledzisz dołączanie lub opuszczanie serwera przez członków; odpowiada zdarzeniom :func:`on_member_join` oraz :func:`on_member_remove`.

source: Whether you want to track member updates such as nickname or role changes.
pl_pl: Czy chcesz śledzić aktualizacje danych członków, takie jak zmiana pseudonimu lub ról.

source: Whether you want to track user updates such as usernames, avatars, discriminators, etc.
pl_pl: Czy chcesz śledzić aktualizacje użytkowników, takie jak nazwy użytkownika, awatary, dyskryminatory itp.

source: Whether you want to request the guild member list through :meth:`Guild.chunk` or :meth:`Guild.fetch_members`.
pl_pl: Czy chcesz żądać listy członków serwera poprzez :meth:`Guild.chunk` lub :meth:`Guild.fetch_members`.

source: Whether you want high accuracy member cache under :attr:`Guild.members`.
pl_pl: Czy potrzebujesz wysokiej dokładności pamięci podręcznej członków w :attr:`Guild.members`.

source: Message Content
pl_pl: Treść wiadomości (Message Content)

source: Whether you use :attr:`Message.content` to check message content.
pl_pl: Czy używasz :attr:`Message.content` do sprawdzania treści wiadomości.

source: Whether you use :attr:`Message.attachments` to check message attachments.
pl_pl: Czy używasz :attr:`Message.attachments` do sprawdzania załączników wiadomości.

source: Whether you use :attr:`Message.embeds` to check message embeds.
pl_pl: Czy używasz :attr:`Message.embeds` do sprawdzania embedów wiadomości.

source: Whether you use :attr:`Message.components` to check message components.
pl_pl: Czy używasz :attr:`Message.components` do sprawdzania komponentów wiadomości.

source: Whether you use the commands extension with a non-mentioning prefix.
pl_pl: Czy używasz rozszerzenia poleceń z prefiksem nierozpoczynającym się od wzmianki (mention).

source: Member Cache
pl_pl: Cache członków

source: Along with intents, Discord now further restricts the ability to cache members and expects bot authors to cache as little as is necessary. However, to properly maintain a cache the :attr:`Intents.members` intent is required in order to track the members who left and properly evict them.
pl_pl: Wraz z intencjami, Discord jeszcze bardziej ogranicza możliwość cache'owania członków i oczekuje, że autorzy botów będą przechowywać tylko niezbędne dane. Jednak aby poprawnie utrzymać cache, wymagana jest intencja :attr:`Intents.members`, by śledzić członków opuszczających serwer i usuwać ich z pamięci.

source: To aid with member cache where we don't need members to be cached, the library now has a :class:`MemberCacheFlags` flag to control the member cache. The documentation page for the class goes over the specific policies that are possible.
pl_pl: Aby pomóc w zarządzaniu pamięcią podręczną tam, gdzie nie potrzebujemy cache'owania wszystkich członków, biblioteka oferuje flagę :class:`MemberCacheFlags`. Dokumentacja tej klasy opisuje dostępne polityki przechowywania danych.

source: It should be noted that certain things do not need a member cache since Discord will provide full member information if possible. For example:
pl_pl: Warto zauważyć, że niektóre funkcje nie wymagają cache'owania członków, ponieważ Discord dostarcza pełne informacje o członku, jeśli to możliwe. Na przykład:

source: :func:`on_message` will have :attr:`Message.author` be a member even if cache is disabled.
pl_pl: W :func:`on_message`, :attr:`Message.author` będzie członkiem (Member), nawet jeśli cache jest wyłączony.

source: :func:`on_voice_state_update` will have the ``member`` parameter be a member even if cache is disabled.
pl_pl: W :func:`on_voice_state_update`, parametr ``member`` będzie członkiem, nawet jeśli cache jest wyłączony.

source: :func:`on_reaction_add` will have the ``user`` parameter be a member when in a guild even if cache is disabled.
pl_pl: W :func:`on_reaction_add`, parametr ``user`` będzie członkiem (w obrębie serwera), nawet jeśli cache jest wyłączony.

source: :func:`on_raw_reaction_add` will have :attr:`RawReactionActionEvent.member` be a member when in a guild even if cache is disabled.
pl_pl: W :func:`on_raw_reaction_add`, :attr:`RawReactionActionEvent.member` będzie członkiem (w obrębie serwera), nawet jeśli cache jest wyłączony.

source: The reaction add events do not contain additional information when in direct messages. This is a Discord limitation.
pl_pl: Zdarzenia dodania reakcji nie zawierają dodatkowych informacji w wiadomościach prywatnych. Jest to ograniczenie Discorda.

source: The reaction removal events do not have member information. This is a Discord limitation.
pl_pl: Zdarzenia usunięcia reakcji nie zawierają informacji o członku. Jest to ograniczenie Discorda.

source: Other events that take a :class:`Member` will require the use of the member cache. If absolute accuracy over the member cache is desirable, then it is advisable to have the :attr:`Intents.members` intent enabled.
pl_pl: Inne zdarzenia przyjmujące obiekt :class:`Member` będą wymagały użycia cache'u członków. Jeśli pożądana jest pełna dokładność pamięci podręcznej, zaleca się włączenie intencji :attr:`Intents.members`.

source: Retrieving Members
pl_pl: Pobieranie członków

source: If the cache is disabled or you disable chunking guilds at startup, we might still need a way to load members. The library offers a few ways to do this:
pl_pl: Jeśli cache jest wyłączony lub wyłączysz „chunking” serwerów przy starcie, nadal możesz potrzebować sposobu na załadowanie członków. Biblioteka oferuje kilka metod:

source: Used to query members by a prefix matching nickname or username.
pl_pl: Służy do wyszukiwania członków po prefiksie pasującym do pseudonimu lub nazwy użytkownika.

source: This can also be used to query members by their user ID.
pl_pl: Może być również użyte do wyszukiwania członków po ich ID użytkownika.

source: This uses the gateway and not the HTTP.
pl_pl: Korzysta z bramy (gateway), a nie z protokołu HTTP.

source: This can be used to fetch the entire member list through the gateway.
pl_pl: Można tego użyć do pobrania całej listy członków poprzez gateway.

source: Used to fetch a member by ID through the HTTP API.
pl_pl: Służy do pobierania członka po ID poprzez API HTTP.

source: used to fetch a large number of members through the HTTP API.
pl_pl: Służy do pobierania dużej liczby członków poprzez API HTTP.

source: It should be noted that the gateway has a strict rate limit of 120 requests per 60 seconds.
pl_pl: Należy pamiętać, że gateway ma rygorystyczny limit (rate limit) wynoszący 120 żądań na 60 sekund.

source: Troubleshooting
pl_pl: Rozwiązywanie problemów

source: Some common issues relating to the mandatory intent change.
pl_pl: Kilka typowych problemów związanych z obowiązkową zmianą intencji.

source: Where'd my members go?
pl_pl: Gdzie podziali się moi członkowie?

source: Due to an :ref:`API change <intents_member_cache>` Discord is now forcing developers who want member caching to explicitly opt-in to it. This is a Discord mandated change and there is no way to bypass it. In order to get members back you have to explicitly enable the :ref:`members privileged intent <privileged_intents>` and change the :attr:`Intents.members` attribute to true.
pl_pl: Z powodu :ref:`zmiany API <intents_member_cache>`, Discord zmusza teraz deweloperów chcących korzystać z cache'owania członków do jawnego wyrażenia na to zgody. Jest to zmiana odgórna i nie da się jej obejść. Aby odzyskać dostęp do członków, musisz jawnie włączyć :ref:`uprzywilejowaną intencję members <privileged_intents>` (intencję członków) i ustawić atrybut :attr:`Intents.members` na „True”.

source: For example:
pl_pl: Na przykład:

source: Why does ``on_ready`` take so long to fire?
pl_pl: Dlaczego ``on_ready`` uruchamia się tak długo?

source: As part of the API change regarding intents, Discord also changed how members are loaded in the beginning. Originally the library could request 75 guilds at once and only request members from guilds that have the :attr:`Guild.large` attribute set to ``True``. With the new intent changes, Discord mandates that we can only send 1 guild per request. This causes a 75x slowdown which is further compounded by the fact that *all* guilds, not just large guilds are being requested.
pl_pl: W ramach zmiany API dotyczącej intencji, Discord zmienił również sposób wstępnego ładowania członków. Pierwotnie biblioteka mogła żądać danych dla 75 serwerów naraz i pobierać członków tylko z serwerów oznaczonych atrybutem :attr:`Guild.large` jako „True”. Przy nowych intencjach Discord wymaga, byśmy wysyłali tylko 1 serwer na żądanie. Powoduje to 75-krotne spowolnienie, które jest pogłębiane przez fakt, że pobierani są członkowi ze *wszystkich* serwerów, a nie tylko tych dużych.

source: There are a few solutions to fix this.
pl_pl: Istnieje kilka rozwiązań tego problemu.

source: The first solution is to request the privileged presences intent along with the privileged members intent and enable both of them. This allows the initial member list to contain online members just like the old gateway. Note that we're still limited to 1 guild per request but the number of guilds we request is significantly reduced.
pl_pl: Pierwszym rozwiązaniem jest poproszenie o uprzywilejowaną intencję obecności (presences) wraz z uprzywilejowaną intencją członków (members) i włączenie obu. Pozwala to na zawarcie online'owych członków na wstępnej liście, podobnie jak w starym gatewayu. Pamiętaj, że nadal ograniczają nas żądania po 1 serwerze, ale liczba serwerów, o które musimy pytać, jest znacznie mniejsza.

source: The second solution is to disable member chunking by setting ``chunk_guilds_at_startup`` to ``False`` when constructing a client. Then, when chunking for a guild is necessary you can use the various techniques to :ref:`retrieve members <retrieving_members>`.
pl_pl: Drugim rozwiązaniem jest wyłączenie chunkingu członków poprzez ustawienie ``chunk_guilds_at_startup`` na ``False`` podczas tworzenia klienta. Gdy zajdzie potrzeba pobrania członków danej gildii, możesz skorzystać z różnych technik :ref:`pobierania członków <retrieving_members>`.

source: To illustrate the slowdown caused by the API change, take a bot who is in 840 guilds and 95 of these guilds are "large" (over 250 members).
pl_pl: Aby zilustrować spowolnienie spowodowane zmianą API: weźmy bota, który jest na 840 serwerach, z czego 95 to serwery „duże” (powyżej 250 członków).

source: Under the original system this would result in 2 requests to fetch the member list (75 guilds, 20 guilds) roughly taking 60 seconds. With :attr:`Intents.members` but not :attr:`Intents.presences` this requires 840 requests, with a rate limit of 120 requests per 60 seconds means that due to waiting for the rate limit it totals to around 7 minutes of waiting for the rate limit to fetch all the members. With both :attr:`Intents.members` and :attr:`Intents.presences` we mostly get the old behaviour so we're only required to request for the 95 guilds that are large, this is slightly less than our rate limit so it's close to the original timing to fetch the member list.
pl_pl: W oryginalnym systemie skutkowałoby to 2 żądaniami pobrania listy członków (75 serwerów, 20 serwerów), co zajmowało ok. 60 sekund. Przy włączonym :attr:`Intents.members`, ale wyłączonym :attr:`Intents.presences`, wymaga to 840 żądań. Przy limicie 120 żądań na 60 sekund, samo czekanie na odblokowanie limitu sumuje się do około 7 minut oczekiwania na pobranie wszystkich członków. Mając włączone obie intencje (:attr:`Intents.members` i :attr:`Intents.presences`), powracamy do zachowania zbliżonego do starego – musimy pytać tylko o 95 dużych serwerów, co mieści się w naszym rate limicie i czas pobierania jest bliski pierwotnemu.

source: Unfortunately due to this change being required from Discord there is nothing that the library can do to mitigate this.
pl_pl: Niestety, ponieważ zmiana ta jest wymagana odgórnie przez Discorda, biblioteka nie może nic zrobić, aby ją złagodzić.

source: If you truly dislike the direction Discord is going with their API, you can contact them via `support <https://dis.gd/contact>`_.
pl_pl: Jeśli naprawdę nie podoba Ci się kierunek, w którym zmierza API Discorda, możesz skontaktować się z nimi poprzez `dział pomocy <https://dis.gd/contact>`_.
