Repository: venxsa/discord.py-master-main
Catalog: docs/locale/*/LC_MESSAGES/intro.po
Languages: pl_pl

source: Introduction
pl_pl: Wprowadzenie

source: This is the documentation for discord.py, a library for Python to aid in creating applications that utilise the Discord API.
pl_pl: To jest dokumentacja discord.py, biblioteki dla języka Python wspomagającej tworzenie aplikacji korzystających z API Discorda.

source: Prerequisites
pl_pl: Wymagania wstępne

source: discord.py works with Python 3.8 or higher. Support for earlier versions of Python is not provided. Python 2.7 or lower is not supported. Python 3.7 or lower is not supported.
pl_pl: discord.py współpracuje z Pythonem w wersji 3.8 lub nowszej. Wsparcie dla starszych wersji Pythona nie jest zapewnione. Python 2.7 lub starszy nie jest obsługiwany. Python 3.7 lub starszy nie jest obsługiwany.

source: Installing
pl_pl: Instalacja

source: You can get the library directly from PyPI: ::
pl_pl: Bibliotekę można pobrać bezpośrednio z PyPI: ::

source: If you are using Windows, then the following should be used instead: ::
pl_pl: Jeśli korzystasz z systemu Windows, należy użyć następującego polecenia: ::

source: To get voice support, you should use ``discord.py[voice]`` instead of ``discord.py``, e.g. ::
pl_pl: Aby uzyskać wsparcie dla głosu, należy użyć ``discord.py[voice]`` zamiast ``discord.py``, np.: ::

source: On Linux environments, installing voice requires getting the following dependencies:
pl_pl: W środowiskach Linux instalacja obsługi głosu wymaga pobrania następujących zależności:

source: For a Debian-based system, the following command will get these dependencies:
pl_pl: W systemach opartych na Debianie poniższe polecenie pozwoli pobrać te zależności:

source: Remember to check your permissions!
pl_pl: Pamiętaj o sprawdzeniu swoich uprawnień!

source: Virtual Environments
pl_pl: Środowiska wirtualne

source: Sometimes you want to keep libraries from polluting system installs or use a different version of libraries than the ones installed on the system. You might also not have permissions to install libraries system-wide. For this purpose, the standard library as of Python 3.3 comes with a concept called "Virtual Environment"s to help maintain these separate versions.
pl_pl: Czasami chcesz uniknąć zaśmiecania instalacji systemowych lub użyć innej wersji bibliotek niż te zainstalowane w systemie. Możesz również nie mieć uprawnień do instalowania bibliotek w całym systemie. W tym celu biblioteka standardowa od wersji Python 3.3 zawiera koncepcję zwaną „Środowiskami Wirtualnymi” (Virtual Environments), która pomaga w utrzymaniu tych oddzielnych wersji.

source: A more in-depth tutorial is found on :doc:`py:tutorial/venv`.
pl_pl: Bardziej szczegółowy samouczek znajduje się w :doc:`py:tutorial/venv`.

source: However, for the quick and dirty:
pl_pl: Jednak w skrócie:

source: Go to your project's working directory:
pl_pl: Przejdź do katalogu roboczego swojego projektu:

source: Activate the virtual environment:
pl_pl: Aktywuj środowisko wirtualne:

source: On Windows you activate it with:
pl_pl: W systemie Windows aktywujesz je za pomocą:

source: Use pip like usual:
pl_pl: Używaj pip jak zwykle:

source: Congratulations. You now have a virtual environment all set up.
pl_pl: Gratulacje. Masz teraz w pełni skonfigurowane środowisko wirtualne.

source: Scripts executed with ``py -3`` will ignore any currently active virtual environment, as the ``-3`` specifies a global scope.
pl_pl: Skrypty wykonywane za pomocą ``py -3`` zignorują każde aktualnie aktywne środowisko wirtualne, ponieważ ``-3`` określa zakres globalny.

source: Basic Concepts
pl_pl: Podstawowe pojęcia

source: discord.py revolves around the concept of :ref:`events <discord-api-events>`. An event is something you listen to and then respond to. For example, when a message happens, you will receive an event about it that you can respond to.
pl_pl: discord.py opiera się na koncepcji :ref:`zdarzeń <discord-api-events>`. Zdarzenie to coś, czego nasłuchujesz, a następnie na co odpowiadasz. Na przykład, gdy pojawi się wiadomość, otrzymasz o tym zdarzenie, na które możesz zareagować.

source: A quick example to showcase how events work:
pl_pl: Szybki przykład pokazujący, jak działają zdarzenia:
