Repository: venxsa/discord.py-master-main
Catalog: docs/locale/*/LC_MESSAGES/logging.po
Languages: pl_pl

source: Setting Up Logging
pl_pl: Konfiguracja logowania

source: *discord.py* logs errors and debug information via the :mod:`logging` python module. In order to streamline this process, the library provides default configuration for the ``discord`` logger when using :meth:`Client.run`. It is strongly recommended that the logging module is configured, as no errors or warnings will be output if it is not set up.
pl_pl: *discord.py* loguje błędy i informacje debugowania za pomocą modułu :mod:`logging` Pythona. Aby usprawnić ten proces, biblioteka dostarcza domyślną konfigurację dla loggera „discord” przy użyciu metody :meth:`Client.run`. Zdecydowanie zaleca się skonfigurowanie modułu logowania, ponieważ w przeciwnym razie błędy i ostrzeżenia nie będą wyświetlane.

source: The default logging configuration provided by the library will print to :data:`sys.stderr` using coloured output. You can configure it to send to a file instead by using one of the built-in :mod:`logging.handlers`, such as :class:`logging.FileHandler`.
pl_pl: Domyślna konfiguracja logowania dostarczana przez bibliotekę wypisuje dane do :data:`sys.stderr` przy użyciu kolorowego wyjścia. Możesz skonfigurować go do przesyłania danych do pliku, używając jednego z wbudowanych handlerów modułu :mod:`logging.handlers`, np. :class:`logging.FileHandler`.

source: This can be done by passing it through :meth:`Client.run`:
pl_pl: Można to zrobić, przekazując handler do :meth:`Client.run`:

source: You can also disable the library's logging configuration completely by passing ``None``:
pl_pl: Możesz również całkowicie wyłączyć domyślną konfigurację logowania biblioteki, przekazując ``None``:

source: Likewise, configuring the log level to ``logging.DEBUG`` is also possible:
pl_pl: Możliwe jest również skonfigurowanie poziomu logowania na ``logging.DEBUG``:

source: This is recommended, especially at verbose levels such as ``DEBUG``, as there are a lot of events logged and it would clog the stderr of your program.
pl_pl: Jest to zalecane, szczególnie przy wysokich poziomach szczegółowości jak ``DEBUG``, ponieważ logowanych jest wiele zdarzeń, które mogłyby zaśmiecić wyjście błędu (stderr) Twojego programu.

source: If you want the logging configuration the library provides to affect all loggers rather than just the ``discord`` logger, you can pass ``root_logger=True`` inside :meth:`Client.run`:
pl_pl: Jeśli chcesz, aby konfiguracja dostarczana przez bibliotekę wpływała na wszystkie loggery, a nie tylko na logger „discord”, możesz przekazać ``root_logger=True`` do :meth:`Client.run`:

source: If you want to setup logging using the library provided configuration without using :meth:`Client.run`, you can use :func:`discord.utils.setup_logging`:
pl_pl: Jeśli chcesz skonfigurować logowanie przy użyciu ustawień biblioteki bez korzystania z :meth:`Client.run`, możesz użyć funkcji :func:`discord.utils.setup_logging`:

source: More advanced setups are possible with the :mod:`logging` module. The example below configures a rotating file handler that outputs DEBUG output for everything the library outputs, except for HTTP requests:
pl_pl: Bardziej zaawansowane konfiguracje są możliwe dzięki modułowi :mod:`logging`. Poniższy przykład konfiguruje rotacyjny handler plików, który zapisuje dane debugowania (DEBUG) dla wszystkiego, co wypisuje biblioteka, z wyjątkiem zapytań HTTP:

source: For more information, check the documentation and tutorial of the :mod:`logging` module.
pl_pl: Więcej informacji znajdziesz w dokumentacji i samouczku modułu :mod:`logging`.

source: The library now provides a default logging configuration.
pl_pl: Biblioteka zapewnia teraz domyślną konfigurację logowania.
