Repository: venxsa/discord.py-master-main
Catalog: docs/locale/*/LC_MESSAGES/quickstart.po
Languages: pl_pl

source: Quickstart
pl_pl: Szybki start

source: This page gives a brief introduction to the library. It assumes you have the library installed, if you don't check the :ref:`installing` portion.
pl_pl: Ta strona zawiera krótkie wprowadzenie do biblioteki. Zakłada ona, że masz już zainstalowaną bibliotekę; jeśli nie, sprawdź sekcję :ref:`installing`.

source: A Minimal Bot
pl_pl: Minimalny Bot

source: Let's make a bot that responds to a specific message and walk you through it.
pl_pl: Stwórzmy bota, który odpowiada na konkretną wiadomość, i przeanalizujmy jego działanie.

source: It looks something like this:
pl_pl: Wygląda to mniej więcej tak:

source: Let's name this file ``example_bot.py``. Make sure not to name it ``discord.py`` as that'll conflict with the library.
pl_pl: Nazwijmy ten plik ``example_bot.py``. Upewnij się, że nie nazwiesz go ``discord.py``, ponieważ spowoduje to konflikt z biblioteką.

source: There's a lot going on here, so let's walk you through it step by step.
pl_pl: Dzieje się tutaj całkiem sporo, więc przejdźmy przez to krok po kroku.

source: The first line just imports the library, if this raises a :exc:`ModuleNotFoundError` or :exc:`ImportError` then head on over to :ref:`installing` section to properly install.
pl_pl: Pierwsza linia po prostu importuje bibliotekę; jeśli spowoduje to błąd :exc:`ModuleNotFoundError` lub :exc:`ImportError`, przejdź do sekcji :ref:`installing`, aby poprawnie ją zainstalować.

source: Next, we create an instance of a :class:`Client`. This client is our connection to Discord.
pl_pl: Następnie tworzymy instancję klasy :class:`Client`. Ten klient jest naszym połączeniem z Discordem.

source: We then use the :meth:`Client.event` decorator to register an event. This library has many events. Since this library is asynchronous, we do things in a "callback" style manner.
pl_pl: Następnie używamy dekoratora :meth:`Client.event`, aby zarejestrować zdarzenie. Ta biblioteka obsługuje wiele zdarzeń. Ponieważ biblioteka jest asynchroniczna, działamy w sposób oparty na funkcjach zwrotnych (tzw. „callbackach”).

source: A callback is essentially a function that is called when something happens. In our case, the :func:`on_ready` event is called when the bot has finished logging in and setting things up and the :func:`on_message` event is called when the bot has received a message.
pl_pl: Funkcja zwrotna to zasadniczo funkcja wywoływana, gdy coś się wydarzy. W naszym przypadku zdarzenie :func:`on_ready` jest wywoływane, gdy bot zakończy logowanie i konfigurację, a zdarzenie :func:`on_message` jest wywoływane, gdy bot otrzyma wiadomość.

source: Since the :func:`on_message` event triggers for *every* message received, we have to make sure that we ignore messages from ourselves. We do this by checking if the :attr:`Message.author` is the same as the :attr:`Client.user`.
pl_pl: Ponieważ zdarzenie :func:`on_message` uruchamia się dla *każdej* otrzymanej wiadomości, musimy upewnić się, że ignorujemy wiadomości od nas samych. Robimy to, sprawdzając, czy :attr:`Message.author` jest taki sam jak :attr:`Client.user`.

source: Afterwards, we check if the :class:`Message.content` starts with ``'$hello'``. If it does, then we send a message in the channel it was used in with ``'Hello!'``. This is a basic way of handling commands, which can be later automated with the :doc:`./ext/commands/index` framework.
pl_pl: Następnie sprawdzamy, czy :class:`Message.content` zaczyna się od ``'$hello'``. Jeśli tak, wysyłamy wiadomość o treści ``'Hello!'`` na kanale, na którym została użyta. Jest to podstawowy sposób obsługi poleceń, który można później zautomatyzować za pomocą szkieletu :doc:`./ext/commands/index`.

source: Finally, we run the bot with our login token. If you need help getting your token or creating a bot, look in the :ref:`discord-intro` section.
pl_pl: Na koniec uruchamiamy bota za pomocą naszego tokena logowania. Jeśli potrzebujesz pomocy w uzyskaniu tokena lub utworzeniu bota, zajrzyj do sekcji :ref:`discord-intro`.

source: Now that we've made a bot, we have to *run* the bot. Luckily, this is simple since this is just a Python script, we can run it directly.
pl_pl: Skoro już stworzyliśmy bota, musimy go *uruchomić*. Na szczęście jest to proste – ponieważ jest to zwykły skrypt Pythona, możemy uruchomić go bezpośrednio.

source: On Windows:
pl_pl: W systemie Windows:

source: On other systems:
pl_pl: W innych systemach:

source: Now you can try playing around with your basic bot.
pl_pl: Teraz możesz spróbować poeksperymentować ze swoim podstawowym botem.
