Repository: venxsa/discord.py-master-main
Catalog: docs/locale/*/LC_MESSAGES/version_guarantees.po
Languages: pl_pl

source: Version Guarantees
pl_pl: Gwarancje dotyczące wersji

source: The library follows a `semantic versioning principle <https://semver.org/>`_ which means that the major version is updated every time there is an incompatible API change. However due to the lack of guarantees on the Discord side when it comes to breaking changes along with the fairly dynamic nature of Python it can be hard to discern what can be considered a breaking change and what isn't.
pl_pl: Biblioteka przestrzega `zasady wersjonowania semantycznego <https://semver.org/>`_, co oznacza, że główna wersja (major) jest aktualizowana za każdym razem, gdy pojawia się niekompatybilna zmiana w API. Jednak ze względu na brak gwarancji ze strony Discorda w kwestii zmian wprowadzających niekompatybilność (breaking changes), a także dynamiczną naturę Pythona, czasem trudno odróżnić, co można uznać za taką zmianę, a co nie.

source: The first thing to keep in mind is that breaking changes only apply to **publicly documented functions and classes**. If it's not listed in the documentation here then it is not part of the public API and is thus bound to change. This includes attributes that start with an underscore or functions without an underscore that are not documented.
pl_pl: Pierwszą rzeczą, o której należy pamiętać, jest to, że zmiany wprowadzające niekompatybilność dotyczą tylko **publicznie udokumentowanych funkcji i klas**. Jeśli dany element nie znajduje się w tej dokumentacji, nie jest częścią publicznego API i może ulec zmianie. Dotyczy to atrybutów zaczynających się od podkreślnika oraz nieudokumentowanych funkcji bez podkreślnika.

source: The examples below are non-exhaustive.
pl_pl: Poniższe przykłady nie wyczerpują tematu.

source: Examples of Breaking Changes
pl_pl: Przykłady zmian wprowadzających niekompatybilność (Breaking Changes)

source: Changing the default parameter value to something else.
pl_pl: Zmiana domyślnego parametru na inną wartość.

source: Renaming a function without an alias to an old function.
pl_pl: Zmiana nazwy funkcji bez pozostawienia aliasu do starej nazwy.

source: Adding or removing parameters to an event.
pl_pl: Dodawanie lub usuwanie parametrów zdarzenia.

source: Examples of Non-Breaking Changes
pl_pl: Przykłady zmian zachowujących kompatybilność (Non-Breaking Changes)

source: Adding or removing private underscored attributes.
pl_pl: Dodawanie lub usuwanie prywatnych atrybutów (z podkreślnikiem).

source: Adding an element into the ``__slots__`` of a data class.
pl_pl: Dodanie elementu do ``__slots__`` w klasie danych.

source: Changing the behaviour of a function to fix a bug.
pl_pl: Zmiana zachowania funkcji w celu naprawienia błędu.

source: Changes in the typing behaviour of the library
pl_pl: Zmiany w typowaniu (typing) biblioteki.

source: Changes in the calling convention of functions that are primarily meant as callbacks
pl_pl: Zmiany w konwencji wywoływania funkcji służących głównie jako callbacki.

source: Changes in the documentation.
pl_pl: Zmiany w dokumentacji.

source: Modifying the internal HTTP handling.
pl_pl: Modyfikacja wewnętrznej obsługi protokołu HTTP.

source: Upgrading the dependencies to a new version, major or otherwise.
pl_pl: Aktualizacja zależności do nowszej wersji.
